import numpy as np

"""
    矩阵相乘
    矩阵的乘法是指两个矩阵的对应行和对应列的元素相乘，然后将乘积相加得到新矩阵的对应元素。
    矩阵的乘法满足结合律和分配律，但不满足交换律。
    矩阵的乘法只有在第一个矩阵的列数等于第二个矩阵的行数时才能进行。 
    矩阵A = (2,3), 矩阵b = (3,2)
    C = A*B
    C.shape = (2,2)
    C[0][0] = A[0][0]*B[0][0] + A[0][1]*B[1][0] + A[0][2]*B[2][0]
"""
a1 = np.array([[1, 2, 5],[3, 4, 5]])

b1 = np.array([[5, 6],[7, 8], [9, 10]])

c1 = np.dot(a1, b1)

print(c1)
print("====================================")
a = np.array([[2, 2, 1],[1,2,2]])

b = np.arange(12).reshape(2, 2, 3)

print(a.shape, b.shape)

c = a * b

print(c)
